In [2]:
%%capture
%load_ext sql
%sql sqlite:///Jobs.db

In [ ]:
#checking the columns in our data

In [3]:
%%sql
SELECT *
FROM recent_grads
LIMIT 5;

 * sqlite:///Jobs.db
Done.

[(0, 1, 2419, 'PETROLEUM ENGINEERING', 'Engineering', 2339, 36, 2057, 282, 0.120564344, 1976, 1849, 270, 1207, 37, 0.018380527, 110000, 95000, 125000, 1534, 364, 193),
 (1, 2, 2416, 'MINING AND MINERAL ENGINEERING', 'Engineering', 756, 7, 679, 77, 0.10185185199999999, 640, 556, 170, 388, 85, 0.117241379, 75000, 55000, 90000, 350, 257, 50),
 (2, 3, 2415, 'METALLURGICAL ENGINEERING', 'Engineering', 856, 3, 725, 131, 0.153037383, 648, 558, 133, 340, 16, 0.024096386, 73000, 50000, 105000, 456, 176, 0),
 (3, 4, 2417, 'NAVAL ARCHITECTURE AND MARINE ENGINEERING', 'Engineering', 1258, 16, 1123, 135, 0.107313196, 758, 1069, 150, 692, 40, 0.050125313, 70000, 43000, 80000, 529, 102, 0),
 (4, 5, 2405, 'CHEMICAL ENGINEERING', 'Engineering', 32260, 289, 21239, 11021, 0.341630502, 25694, 23170, 5180, 16697, 1672, 0.061097712, 65000, 50000, 75000, 18314, 4440, 972)]

In [ ]:
#MIN() aggregate function

In [4]:
%%sql
SELECT Major, MIN(Unemployment_rate)
FROM recent_grads

 * sqlite:///Jobs.db
Done.

[('MATHEMATICS AND COMPUTER SCIENCE', 0.0)]

In [ ]:
#Renaming columns

In [7]:
%%sql
SELECT Major, MIN(ShareWomen) AS Minimum_Women
FROM recent_grads

 * sqlite:///Jobs.db
Done.

[('MISCELLANEOUS ENGINEERING TECHNOLOGIES', 0.0)]

In [ ]:
#MAX() aggregate function

In [4]:
%%sql
SELECT Major, MAX(Unemployment_rate) AS max_unemployed
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[('NUCLEAR ENGINEERING', 0.177226407)]

In [ ]:
#Getting distinct values from a column using DISTINCT function

In [5]:
%%sql
SELECT DISTINCT Major_category 
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[('Engineering',),
 ('Business',),
 ('Physical Sciences',),
 ('Law & Public Policy',),
 ('Computers & Mathematics',),
 ('Agriculture & Natural Resources',),
 ('Industrial Arts & Consumer Services',),
 ('Arts',),
 ('Health',),
 ('Social Science',),
 ('Biology & Life Science',),
 ('Education',),
 ('Humanities & Liberal Arts',),
 ('Psychology & Social Work',),
 ('Communications & Journalism',),
 ('Interdisciplinary',)]

In [ ]:
#maximum value of specific entries using WHERE clause

In [7]:
%%sql
SELECT Major_category, MAX(Unemployed) AS total_unemployed
FROM recent_grads
WHERE Major_category = "Engineering";

 * sqlite:///Jobs.db
Done.

[('Engineering', 4650)]

In [ ]:
#COUNT() aggregate function

In [11]:
%%sql
SELECT COUNT(Major) AS total_major
FROM recent_grads
WHERE Major_category = "Engineering";

 * sqlite:///Jobs.db
Done.

[(29,)]

In [ ]:
#AVG() aggregate function

In [15]:
%%sql
SELECT AVG(Unemployment_rate) * 100 AS avg_unemployed
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[(6.858728923255816,)]

In [ ]:
#ROUND() aggregate function. Takes two arguements, the second one being the decimal places

In [16]:
%%sql
SELECT ROUND(AVG(Unemployment_rate) * 100, 2) AS avg_unemployed
FROM recent_grads

 * sqlite:///Jobs.db
Done.

[(6.86,)]

In [17]:
#Rounding off values in a column

In [20]:
%%sql
SELECT ROUND(ShareWomen, 2) AS ShareWomen_round
FROM recent_grads
LIMIT 5;

 * sqlite:///Jobs.db
Done.

[(0.12,), (0.1,), (0.15,), (0.11,), (0.34,)]

In [21]:
#combining multiple aggregate functions in one query.
#To enhance readability, every aggregate function can be broken down into its own line

In [26]:
%%sql
SELECT 
    ROUND(AVG(Unemployment_rate), 2) AS Average,
    MIN(Unemployment_rate) AS min_unemployment,
    ROUND(MAX(Unemployment_rate), 2) AS max_unemployment
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[(0.07, 0.0, 0.18)]

In [27]:
#Missing values

In [28]:
%%sql
SELECT *
FROM recent_grads
WHERE Unemployment_rate ISNULL;

 * sqlite:///Jobs.db
Done.

[(73, 74, 3801, 'MILITARY TECHNOLOGIES', 'Industrial Arts & Consumer Services', 124, 4, 1756, 1323, 0.429684963, 0, 111, 0, 111, 0, None, 40000, 40000, 40000, 0, 0, 0)]

In [29]:
#Arithmetic operations

In [35]:
%%sql
SELECT ROUND(ShareWomen, 2), ROUND(ShareWomen * 100, 2) AS percent_female
FROM recent_grads
LIMIT 10;

 * sqlite:///Jobs.db
Done.

[(0.12, 12.06),
 (0.1, 10.19),
 (0.15, 15.3),
 (0.11, 10.73),
 (0.34, 34.16),
 (0.14, 14.5),
 (0.54, 53.57),
 (0.44, 44.14),
 (0.14, 13.98),
 (0.44, 43.78)]